Revit 2024 API
ViewPrintingEventArgs Class
 The event arguments used by the ViewPrinting event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2010
Syntax
C#
public class ViewPrintingEventArgs : RevitAPIPreDocEventArgs
Visual Basic
Public Class ViewPrintingEventArgs _
	Inherits RevitAPIPreDocEventArgs
Visual C++
public ref class ViewPrintingEventArgs : public RevitAPIPreDocEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.ViewPrintingEventArgs
See Also
ViewPrintingEventArgs Members
Autodesk.Revit.DB.Events Namespace